In [1]:
import pandas as pd

In [2]:
xls = pd.ExcelFile('tyb2122.xlsx')
#print(type(xls))
excel_map = pd.read_excel(xls, sheet_name=None)
print(excel_map.keys())

/opt/homebrew/anaconda3/lib/python3.9/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

dict_keys(['March 22', 'February 22', 'January 22', 'December 21', 'November 21', 'October 21', 'September 21', 'August 21', 'July 21', 'June 21', 'May 21', 'April 21', 'Template', 'Lists'])

In [71]:
df_dict = excel_map

In [72]:
print(type(df_dict))

<class 'dict'>

In [4]:
print(type(df['March 22']))

<class 'pandas.core.frame.DataFrame'>

In [73]:
exclude_sheets = ['Template', 'Lists']
#display(totals_df.shape)
month_totals_df= pd.DataFrame()
totals_df= pd.DataFrame()

for k in df_dict.keys():
    #print(k)
    if k in exclude_sheets:
        #print("Excluded")
        continue
    else:
        current_month_df = pd.DataFrame(df[k].groupby('Category')['Actual'].sum())
        #Add current month to new dataframe
        current_month_df['month'] = k
        display(current_month_df.head(10))
        #display(totals_df)
        month_totals_df = pd.concat([month_totals_df, current_month_df], axis=0, ignore_index=False)

# Group the months
totals_df = pd.DataFrame(month_totals_df.groupby('Category')['Actual'].sum())
# output to csv
month_totals_df.to_csv('categories_all_months.csv')
totals_df.to_csv('category_totals.csv')

#print(totals_df)

              Actual     month
Category
Airbnb       1197.29  March 22
Broadband     -27.68  March 22
Council Tax     0.00  March 22
Electricity -1002.07  March 22
Furnishings  -608.53  March 22
Household     -36.93  March 22
Laundry      -218.10  March 22
Loan        -3347.68  March 22
Maintenance  -114.34  March 22
Mortgage     -241.07  March 22

              Actual        month
Category
Airbnb       1099.20  February 22
Broadband     -27.68  February 22
Council Tax     0.00  February 22
Electricity  -103.66  February 22
Furnishings  -104.07  February 22
Household     -17.01  February 22
Laundry         0.00  February 22
Loan         -179.06  February 22
Maintenance  -255.43  February 22
Misc           -5.10  February 22

              Actual       month
Category
Airbnb       1320.67  January 22
Broadband     -27.68  January 22
Council Tax     0.00  January 22
Electricity  -103.66  January 22
Furnishings  -175.68  January 22
Household    -111.26  January 22
Laundry      -229.60  January 22
Loan         -179.06  January 22
Logs         -170.00  January 22
Maintenance   -58.10  January 22

              Actual        month
Category
Airbnb       1137.52  December 21
Broadband     -27.68  December 21
Cottages       75.00  December 21
Council Tax     0.00  December 21
Electricity  -103.66  December 21
Furnishings   -83.64  December 21
Household     -49.82  December 21
Laundry      -176.80  December 21
Loan         -179.06  December 21
Maintenance    -5.71  December 21

              Actual        month
Category
Advertising   -60.00  November 21
Airbnb       1419.00  November 21
Broadband     -27.68  November 21
Council Tax     0.00  November 21
Electricity  -103.66  November 21
Furnishings   -38.65  November 21
Household     -17.55  November 21
Laundry       -89.30  November 21
Loan         -179.06  November 21
Maintenance   -53.29  November 21

              Actual       month
Category
Airbnb       1298.28  October 21
Broadband     -27.68  October 21
Cottages      263.28  October 21
Council Tax     0.00  October 21
Electricity  -103.66  October 21
Furnishings   -45.18  October 21
Household     -29.74  October 21
Insurance    -287.79  October 21
Laundry      -100.40  October 21
Loan         -179.06  October 21

             Actual         month
Category
Airbnb       655.52  September 21
Broadband    -27.68  September 21
Cottages     475.00  September 21
Council Tax    0.00  September 21
Electricity -103.66  September 21
Furnishings -166.72  September 21
Household   -117.51  September 21
Laundry     -152.90  September 21
Loan        -179.06  September 21
Maintenance  -26.99  September 21

              Actual      month
Category
Airbnb       2632.69  August 21
Broadband     -27.68  August 21
Council Tax     0.00  August 21
Electricity  -103.66  August 21
Furnishings   -68.64  August 21
Household     -32.90  August 21
Laundry      -114.40  August 21
Loan         -179.06  August 21
Maintenance  -165.00  August 21
Mortgage     -241.07  August 21

              Actual    month
Category
Airbnb       1259.22  July 21
Broadband     -27.68  July 21
Cottages     1206.20  July 21
Council Tax     0.00  July 21
Electricity  -103.66  July 21
Furnishings  -141.22  July 21
Household     -14.42  July 21
Laundry      -170.00  July 21
Loan         -179.06  July 21
Maintenance   -48.37  July 21

              Actual    month
Category
Airbnb       1126.92  June 21
Broadband     -27.68  June 21
Cottages      483.44  June 21
Council Tax     0.00  June 21
Electricity   -61.87  June 21
Furnishings  -116.44  June 21
Household     -51.03  June 21
Loan         -179.06  June 21
Maintenance    -3.99  June 21
Mortgage     -241.07  June 21

             Actual   month
Category
Airbnb         0.00  May 21
Broadband    -27.68  May 21
Cottages       0.00  May 21
Council Tax    0.00  May 21
Electricity  -61.87  May 21
Furnishings  -25.66  May 21
Household     -6.00  May 21
Laundry     -241.20  May 21
Loan        -179.06  May 21
Maintenance   34.51  May 21

             Actual     month
Category
Airbnb       512.84  April 21
Broadband    -23.50  April 21
Cottages     267.36  April 21
Council Tax    0.00  April 21
Electricity -111.87  April 21
Furnishings  -26.16  April 21
Household    -16.92  April 21
Loan        -179.06  April 21
Maintenance -100.00  April 21
Private      352.50  April 21

april_df = df['April 21']
print(april_df.head(5))
april_df.columns = ['Date', 'Category', 'Detail', 'In / Out', 'Amount', 'Actual', 'Notes',
       'Unnamed: 7', 'Unnamed: 8']
print(april_df.head(5))

In [17]:
march_df = df['March 22']

In [18]:
march_actuals = march_df.groupby('Category')['Actual'].sum()
march_actuals.head(100)

Category
Airbnb         1197.29
Broadband       -27.68
Council Tax       0.00
Electricity   -1002.07
Furnishings    -608.53
Household       -36.93
Laundry        -218.10
Loan          -3347.68
Maintenance    -114.34
Mortgage       -241.07
Private         240.00
TV Licence      -13.37
Water           -25.00
Welcome        -130.07
Name: Actual, dtype: float64

In [8]:
# TODO Per month